app/controllers/page_controller.rb

  def home
    @news = NewsApiHelper.call(country: I18n.locale, category: user_pref).res
    @admin_news = NewsItem.where(news_type: NewsType.find_by(type_name: user_pref))
---
SELECT "news_types".* FROM "news_types" WHERE "news_types"."type_name" = ? LIMIT ?  [["type_name", "entertainment"], ["LIMIT", 1]]