app/controllers/user_controller.rb

  def update_preferences
    User.find_by(email: current_user.email).update(preference: params[:pref])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "tetovske@yandex.ru"], ["LIMIT", 1]]
UPDATE "users" SET "preference" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["preference", "entertainment"], ["updated_at", "2020-01-13 16:41:58.819224"], ["id", 1]]