zachetka_news/app/controllers/news_items_controller.rb

  def index
    @news_items = NewsItem.all
---
SELECT "news_items".* FROM "news_items"

  def create
    @news_item = NewsItem.new(news_item_params.to_h.reject { |k| k.eql?(NEWS_TYPE_PARAM_NAME) })
    @news_item.news_type = NewsType.find_by(type_name: params[NEWS_ITEM_PARAM_NAME][NEWS_TYPE_PARAM_NAME])

    if @news_item.save
---
SELECT "news_types".* FROM "news_types" WHERE "news_types"."type_name" = ? LIMIT ?  [["type_name", "business"], ["LIMIT", 1]]
INSERT INTO "news_items" ("news_type_id", "title", "subtitle", "source_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    puts "TEST #{news_item_params}"
    if @news_item.update(news_item_params)
---
UPDATE "news_items" SET "subtitle" = ?, "updated_at" = ? WHERE "news_items"."id" = ?  [["subtitle", "Основная часть новости. Здесь в полной мере раскрываются роды Юрия Дудя"], ["updated_at", "2020-11-22 23:54:27.138751"], ["id", 10]]

  def destroy
    @news_item.destroy
---
DELETE FROM "news_items" WHERE "news_items"."id" = ?  [["id", 2]]

  def set_news_item
    @news_item = NewsItem.find(params[:id])
---
SELECT "news_items".* FROM "news_items" WHERE "news_items"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]